openfoam/test/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    // x: -160 (inlet) to 1600 (outlet)
    // y/z: -640 to 640 (farfield, 8D)

    // rear face (x = -160)
    (-160 -640 -640)  // 0
    ( -160  640 -640)  // 1
    ( -160  640  640)  // 2
    (-160 -640  640)  // 3

    // front face (x = 1600)
    (1600 -640 -640)  // 4
    (1600  640 -640)  // 5
    (1600  640  640)  // 6
    (1600 -640  640)  // 7
);

blocks
(
    hex (0 4 5 1 3 7 6 2)
    (80 64 64)              // cells: x × y × z
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    farfield
        {
            type patch;
            faces
            (
                (0 1 5 4)  // bottom
                (2 3 7 6)  // top
                (0 4 7 3)  // front
                (1 2 6 5)  // back
            );
        }
);

mergePatchPairs
(
);


// ************************************************************************* //
